# 最终结果
# allmdr(824-820) 
# df20122013(832-829)
# 用3个变量建立唯一索引，进行匹配
##############################################################################
基于以下代码的查重，对原始数据进行的修改
allmdr中      [姓名==郭学初 登记分类==初治失败]，将姓名改为 郭学初1
df20092013中  [姓名==郭学初 登记分类==初治失败]，将姓名改为 郭学初1

allmdr中      [姓名==王德武 登记分类==复发]，将姓名改为 王德武1
df20092013中  [姓名==王德武 登记分类==复发]，将姓名改为 王德武1

allmdr中       [姓名==王祖根 登记分类==复发]，将姓名改为 王祖根1
df20092013中   [姓名==王祖根 登记分类==复发]，将姓名改为 王祖根1

allmdr中       [姓名==沈柏松 药敏结果报告日期==2012/1/4]，将姓名改为 沈柏松1
df20092013中   [姓名==沈柏松 登记日期==2012/1/10]，将姓名改为 沈柏松1
#############################################################################

setwd("G:/work/MDR/数据")
allmdr=read.csv("allmdr824.csv")##824个案 2014年国家调查的，纳入GFP治疗595，未纳入229
df20092013=read.csv("df20092013_832.csv")###832个案

#######################################################
####   1    ###########################################
####第一次 索引########################################
####用4个变量匹配 #####################################
####第一次删除结果  allmdr824变为allmdr822 ############
####第一次删除结果  df20092013_832变为allmdr830 #######


######################  allmdr824变成allmdr822  ###############################
#建立用于查重的索引变量dup
allmdr$dup=duplicated(allmdr[,c(1,4,5,6)])
##1地市名称 4登记分类 5姓名 6性别

library(dplyr)
##查看dup==true即1的患者
filter(allmdr,dup==1)###有两个重复患者，查看

#######查看两者信息
# filter(allmdr,姓名=="毛进开")
# filter(allmdr,姓名=="朱新潮")

###毛进开 和 朱新潮 确实重复了，删掉，allmdr822
allmdr=filter(allmdr,dup==0)
##allmr822个案

###########  df20092013_832变成 df20092013_830 ################################
#建立用于查重的索引变量dup
df20092013$dup=duplicated(df20092013[,c(9,24,4,5)])##9地市名称(首登记地区) 24登记分类 4姓名 5性别

library(dplyr)
##查看dup==true
filter(df20092013,dup==1)###有两个重复患者

#######查看两者信息
# filter(df20092013,姓名=="陈立海")##有三个人叫陈立海 删两个209442566,210896094
# filter(df20092013,姓名=="沈柏松")#215427698 没重复

###陈立海确实重复了，删掉，数据重新赋值给df20092013 ##830个案
df20092013=filter(df20092013,病案ID!=209442566 & 病案ID!=210896094)


#######################################################
####   2    ###########################################
####第二次 索引    ####################################
####用3个变量进行匹配 #################################
####第二次删除结果 allmdr822变为allmdr820 #############
####此二次删除结果 df20092013_830变为df20092013_829 ###


############# allmdr822变成allmdr820 ######################################### 
##重新建立索引，索引减少了登记分类这一变量
allmdr$dup1=duplicated(allmdr[,c(1,5,6)])
##1地市名称  5姓名 6性别

##查看dup1==true
filter(allmdr,dup1==1)
### 还有6个重复患者: "郭学初","王德武","王祖根","沈柏松","孙新学","周汉斌"
### allmdr 6重复者中的5个患者，前五个，df20092013中也有2个叫一个名字的
### allmdr 6重复者中的1个患者，“周汉斌”，df20092013中只有1个

#删掉allmdr一个“周汉斌”
filter(allmdr,姓名=="周汉斌")
allmdr=filter(allmdr,耐多药.广泛耐药肺结核患者登记号!="2013-00014")
##821个案

#不看这段##allmdr 6重复者中的5个患者，在df20092013中也是重复的,有很大的可能性是确实是重名了或者二次发病了，我认为有4个人是这种情况("郭学初","王德武","王祖根","沈柏松")，有1个人("周汉斌")是真的重复了，

#不看这段#我修改了4个重复姓名患者的原始数据后，再次运行程序后就只显示两个了（"孙新学","周汉斌"），

# "孙新学"是真的重复，不是重名（df和allmdr中都有两个“孙新学”），都删掉一个
# 查看"孙新学"
filter(allmdr,姓名=="孙新学")#不要：序号362;耐多药.广泛耐药肺结核患者登记号!="09063R"
allmdr=filter(allmdr, 耐多药.广泛耐药肺结核患者登记号!="09063R")
##820个案

########## df20092013_830变成 df20092013_829 #################################
##重新建立索引，索引减少了登记分类
df20092013$dup1=duplicated(df20092013[,c(9,4,5)])
##9地市名称  4姓名 5性别
##查看dup==true即1的患者
filter(df20092013,dup1==1)
###索引变为3各变量后，还有4个重复患者,其中有三个改过原始数据的名称了
# 只剩孙新学了，删之
# 查看
filter(df20092013,姓名=="孙新学")#不要：病案ID 209504203
# 删除
df20092013=filter(df20092013,病案ID!=209504203)
# 829个案



# #以下代码用于查看四个重复者，发现是重名
# filter(allmdr,姓名=="郭学初")
# filter(df20092013,姓名=="郭学初")

# filter(allmdr,姓名=="王德武")
# filter(df20092013,姓名=="王德武")

# filter(allmdr,姓名=="王祖根")
# filter(df20092013,姓名=="王祖根")

# filter(allmdr,姓名=="沈柏松")
# filter(df20092013,姓名=="沈柏松")



merge2=merge(df20092013, allmdr, by =c("姓名","性别","地市名称"),
       all = TRUE,
      sort = TRUE, suffixes = c(".df20092013",".allmdr"),
      )
write.csv(merge2,"merge2.csv")

# library(readxl)
# zhuanbao=read.csv("G:/work/MDR/数据/专报0913填补治疗日期用.csv")
# merge3=merge(merge2,zhuanbao,by=c("登记日期","出生日期"),all.x = TRUE, all.y = FALSE)

# setwd("G:/work/MDR")
# treatment580=read.csv("treatment580.csv")##580个案 
# mdr262=read.csv("MDR262.csv")###832个案

# merge262and580=merge(mdr262, treatment580, by ="姓名",
#        all = TRUE,
#       sort = TRUE, suffixes = c(".mdr262",".treatment580"),
#       )
# write.csv(merge262and580,"merge262and580.csv")
